var data8 = [
  {
    colorscale: [

      
     
      
      ['0.0', 'rgb(158,202,225)'],
      ['0.2', 'rgb(107,174,214)'],
      ['0.4', 'rgb(66,146,198)'],
      ['0.6', 'rgb(33,113,181)'],
      ['0.7', 'rgb(8,81,156)'],
      ['0.8', 'rgb(8,48,107)'],
      ['1.0', 'rgb(3,19,43)'],

  ],
  
    hovertemplate: 'Регион: %{text}<br>Средний индекс: %{z}%',
    z: [
      
      ['','', '', '', 62.8, 67.5, 53.6],
      ['','', '', '', 62.3, 63, 50.1, 57.3],
      ['','', 66.9, 60.9, 62.8,65.3,67.8, 72.6],
      ['','', '', 64.4, 60.1,69.1,66.9],
      ['','', '', 65.3, 62.1, 61, 68.7, 62.2, 60.6,'', '', '', 67.6],
      ['','', 60.7, 67.2, 61.5, 66.3, 65.7, 62.2, 66.7, 62.2, 66, 62.4, 61.1, 52.8, 62.1, '', 62.7],
      ['','',68.5, 66.4, 63.4, 64.1, 65.1, 68.7, 67.5, 61.6, 68, 62.3, 64.1, 63, 62.7, 59.7],
      [65.5, '', 64.7, 60.2, 68.4, 68.3, 66.5,61.4, 65.6,67.8,68.4,65.6,62.8,66.9, 60.2, 64.6,'', 63],
      ['', '', 65.5, 65.8, 67.6, '','','',70.6, 66.9, 65.7,'','',62.3, '', 61.8, 64.1], 
      [73.4, '', '', 73.4, '', '','', '','',65.7, '','','','','','',59.2, 60.3],
      [66.2, '', '', '', 66.1], ],
    text: [
      ['','', '', '', 'КБР', 'СОА','ИНГ', '','','','','', '','','','','', '','','','','', ],
      ['','', '', '', 'КЧР', 'СТА','ЧЕЧ','ДАГ', '','','','','', '','','','','', '','','','','',],
      ['','', 'КРМ', 'АДГ', 'КРД','РОС','КЛМ', 'АСТ', '','','','','','', '','','','','', '','','','','',],
      ['','', '', 'НРГ', 'БЕЛ','ВОР','ВГГ', '','','','','','', '','','','','', '','','','','',],
      ['','', '', 'КРС', 'ЛИП','ТАМ','ПЕН', 'САР', 'ОРЕ','', '', '','АЛТ', '','','','','','', '','','','','', '','','','','',],
      ['','','БРЯ', 'ОРЛ', 'ТУЛ','РЯЗ','МРД', 'УЛН', 'САМ','БАШ', 'ЧЕЛ','ОМС','ГАЛ','ТЫВ','ЗАБ', '', 'ПРИ', '', '', '', ''],
      ['','','СМО', 'КЛЖ', 'МОС','ВЛА','НЖГ', 'ЧУВ', 'ТАТ','УДМ', 'СВР','КРГ','НВС','ХАК','БУР','ЕВР', '', '', '', ''],
      ['КЛГ', '', 'ПСК','ТВЕ','ЯРО', 'ИВА', 'КОС','МРЛ', 'КИР','ПЕР','ХМА','ТЮМ','КЕМ','ИРК', 'АМУ', 'ХБР','', 'САХ', ''],
      ['', '', 'ЛЕН','НВГ','ВОЛ', '','','','АРХ','КОМ','ЯМН','','','КРР', '', 'ЯКУ', 'МАГ', '', '', ''],
      ['МСК', '', '', 'КАР', '', '','', '','', 'НЕН','','','','','','','ЧУК','КАМ', ''],
      ['СПБ', '', '', '', 'МУР', '','','','','','', '','','','','', '','','','','',],],
    x: ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S'],
    y: ['X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'h', 'i'],
    type: 'heatmap',

    hoverongaps: false,
    colorbar: {
      tickfont: {
        color: legendc // Установите желаемый цвет подписей цветовой шкалы
      }
    }
  }
];

var layout8 = {
  
  dragmode: false,
  margin: {
    l: 0, // Левый отступ
    r: 0, // Правый отступ
    t: 0, // Верхний отступ
    b: 0, // Нижний отступ
  },
  annotations: [],
  xaxis: {
    scaleanchor: 'y',
          scaleratio: 1,
    visible: false,

  },
  yaxis: {
    scaleanchor: 'x',
          scaleratio: 1,
    visible: false
  },
  showlegend: false,

};

for (var i = 0; i < data8[0].y.length; i++) {
  for (var j = 0; j < data8[0].x.length; j++) {
    var currentValue = data8[0].text[i][j];
    var textColor = 'white';
    layout8.annotations.push({
      x: data8[0].x[j],
      y: data8[0].y[i],
      text: currentValue,
      font: {
        family: 'Arial',
        size: 14,
        color: textColor
      },
      showarrow: false
    });
  }
}
var config8 = {
  displayModeBar: false
};

Plotly.newPlot('myChart8', data8, layout8, config8);
